       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGRAMXXX.
      *===========================================
      *== AUTOR: YAGO             EMPRESA: XPTO
      *== OBJETIVO: 
      *== DATA: 
      *== OBSERVAÇÕES:
      *===========================================
       ENVIROMENT                  DIVISION.
       CONFIGURATION               SECTION.
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
       DATA DIVISION.
       WORKING-STORAGE             SECTION.
      
       PROCEDURE                   DIVISION.
       0001-PRINCIPAL              SECTION.
       0100-INICIALIZAR            SECTION.
       0200-PROCESSAR              SECTION.
       0300-FINALIZAR              SECTION.
           STOP RUN.